#include <iostream>

using namespace std;

//Напишете код со којшто ќе вчитате три вредности x,y,z, и потоа еден по еден ќе ги извршите следниве изрази:
//
//y = ++x && (z+5 || --y)
//z = z-- || (x>y) && (x>z)
//Испечатете ги вредностите на x,y,z по секое извршување на горните изрази.

//Input
// -1 -1 -1
//Output
// 0 0 -1
// 0 0 1

int main() {
    int x, y, z;
    cin >> x >> y >> z;

    y = ++x && (z + 5 || --y);
    cout << x << " " << y << " " << z << endl;

    z = z-- || (x > y) && (x > z);
    cout << x << " " << y << " " << z;
    return 0;
}
