#include <iostream>
//Цик-цак е број за кој што важи дека за секој пар соседни цифри,
// тие се наизменично поголеми односно помали една во однос на друга.
// На пример, ако бројот x е составен од цифрите a, b, c, d и е, тогаш за нив важи:
//
//a>b, b<c, c>d, d<e или a<b, b>c, c<d, d>e
//
//Пр. 343, 4624, 6231209
//Од тастатура се читаат непознат број цели броеви поголеми од или еднакви на 10 (броевите помали од 10 се игнорираат).
// Читањето завршува во моментот кога ќе се прочита знак што не е цифра. Да се испечатат сите цик-цак броеви.

//Input
// 343
// 22
// 4624
// 123456
// 6231209
// 9
// k
//Output
// 343
// 4624
// 6231209

//Input
// 5
// -10
// -9261
// 9
// 12
// k
//Output
// 12

using namespace std;

int main() {
    int n;

    while (cin >> n) {
        if (n < 10) {
            continue;
        }

        int tmp = n;
        int flag = 1;
        int cifra1 = 0;
        int cifra2 = 0;

        while (tmp) {
            if (tmp / 10 == 0) {
                break;
            }

            if (tmp % 10 > (tmp % 100) / 10) {
                if (cifra1 > cifra2) {
                    flag = 0;
                    break;
                }
            } else if (tmp % 10 < (tmp % 100) / 10) {
                if (cifra1 < cifra2) {
                    flag = 0;
                    break;
                }
            } else {
                flag = 0;
                break;
            }

            cifra1 = tmp % 10;
            cifra2 = (tmp % 100) / 10;
            tmp /= 10;
        }

        if (flag) {
            cout << n << endl;
        }
    }
    return 0;
}
