#include <iostream>
//Пресметајте ја цената за електрична енергија која еден корисник треба да ја плати, во зависност од тоа колку kWh потрошил.
// За помалку 500 kWh се наплаќа 5 ден/kWh. Ако трошокот ја надмине оваа граница, тогаш за наредните 150 kWh се наплаќа 7.5 ден/kWh,
// за наредните 200 kWh се наплаќа 11 ден/kWh, а за секој трошок над тоа се доплаќа уште 13.5 ден/kWh.
// На крајот на сметката се додава 10% ДДВ доколку изнесува 7000 денари или помалку, додека ако изнесува повеќе од тоа, се додава 18% ДДВ.

//Input
//1000
//Output
//9263.00

//Input
// 18000
//Output
// 280073.00

using namespace std;

int main() {

    int struja;
    cin >> struja;

    float cena = 0;
    if (struja <= 500) {
        cena = struja * 5;
    } else if (struja <= 650) {
        cena = (struja - 500) * 7.5 + 5 * 500;
    } else if (struja <= 850) {
        cena = (struja - 650) * 11 + 150 * 7.5 + 5 * 500;
    } else {
        cena = (struja - 850) * 13.5 + 150 * 7.5 + 5 * 500 + 200 * 11;
    }

    if (cena <= 7000) {
        cout << cena * 1.1;
    } else {
        cout << cena * 1.18;
    }

    return 0;
}